rest_benchmark_lab/results/tornado_root.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        TornadoServer/6.5.6
Server Hostname:        127.0.0.1
Server Port:            8002

Document Path:          /
Document Length:        41 bytes

Concurrency Level:      50
Time taken for tests:   0.210 seconds
Complete requests:      500
Failed requests:        0
Total transferred:      114000 bytes
HTML transferred:       20500 bytes
Requests per second:    2376.32 [#/sec] (mean)
Time per request:       21.041 [ms] (mean)
Time per request:       0.421 [ms] (mean, across all concurrent requests)
Transfer rate:          529.10 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.6      0       8
Processing:     6   19   3.1     19      25
Waiting:        1   18   3.1     19      23
Total:          9   20   2.6     19      25

Percentage of the requests served within a certain time (ms)
  50%     19
  66%     20
  75%     21
  80%     21
  90%     23
  95%     24
  98%     24
  99%     25
 100%     25 (longest request)