rest_benchmark_lab/results/tornado_slow_blocking.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        TornadoServer/6.5.6
Server Hostname:        127.0.0.1
Server Port:            8002

Document Path:          /slow_endpoint
Document Length:        63 bytes

Concurrency Level:      20
Time taken for tests:   6.100 seconds
Complete requests:      60
Failed requests:        0
Total transferred:      15000 bytes
HTML transferred:       3780 bytes
Requests per second:    9.84 [#/sec] (mean)
Time per request:       2033.418 [ms] (mean)
Time per request:       101.671 [ms] (mean, across all concurrent requests)
Transfer rate:          2.40 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.3      0       4
Processing:   102 1678 607.0   2031    2037
Waiting:      102 1677 607.1   2031    2037
Total:        106 1679 605.8   2031    2037

Percentage of the requests served within a certain time (ms)
  50%   2031
  66%   2032
  75%   2032
  80%   2033
  90%   2034
  95%   2037
  98%   2037
  99%   2037
 100%   2037 (longest request)