rest_benchmark_lab/results/tornado_slow_fixed.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        TornadoServer/6.5.6
Server Hostname:        127.0.0.1
Server Port:            8002

Document Path:          /slow_endpoint_fixed
Document Length:        60 bytes

Concurrency Level:      20
Time taken for tests:   0.650 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      24700 bytes
HTML transferred:       6000 bytes
Requests per second:    153.73 [#/sec] (mean)
Time per request:       130.099 [ms] (mean)
Time per request:       6.505 [ms] (mean, across all concurrent requests)
Transfer rate:          37.08 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   1.2      0       4
Processing:   102  107   2.2    108     110
Waiting:      101  107   2.3    107     110
Total:        103  108   2.1    108     111

Percentage of the requests served within a certain time (ms)
  50%    108
  66%    108
  75%    109
  80%    110
  90%    110
  95%    110
  98%    111
  99%    111
 100%    111 (longest request)